Repository: 84000/data-translation-memory
Catalog: toh153_84000-the-questions-of-the-naga-king-sagara-1-.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཕྱིར་མི་ལྡོག་པའི་ཆོས་ལ་ཡང་དག་པར་གཞོལ་བ་དང་། བཟོད་པ་ཐོབ་པ་དང་། ལུང་བསྟན་པ་ཐོབ་པ་ལགས།
en: How do bodhisattvas genuinely pursue the irreversible Dharma? How do they reach acceptance and obtain prophecy?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀླུའི་བདག་པོ་ལེགས་སོ་ལེགས་སོ།
en: The Blessed One responded to Nāga King Sāgara, “Nāga Lord, excellent, excellent.

source: །ཁྱོད་དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་འདྲི་བར་སེམས་པ་ནི་ཀླུའི་བདག་པོ་ཁྱོད་ལེགས་སོ།
en: It is excellent that you, Nāga Lord, thought to ask the Thus-Gone One about these subjects.

source: །ཀླུའི་བདག་པོ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་ཁྱོད་ལ་བཤད་དོ། །བཅོམ་ལྡན་འདས་ལེགས་སོ་ཞེས་གསོལ་ཏེ། ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Nāga Lord, listen well, bear what I say in mind, and I will answer.

source: །ཀླུའི་བདག་པོ་ཆོས་བཞི་དང་ལྡན་ན། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ངན་འགྲོ་དང་ངན་སོང་ཐམས་ཅད་ཡང་དག་པར་ཆད་པར་འགྱུར་ཏེ།
en: “Nāga Lord, if bodhisattvas possess four qualities, they genuinely eliminate rebirth in the lower realms and painful transmigrations.

source: བཞི་གང་ཞེ་ན་འདི་ལྟ་སྟེ།
en: What are these four?

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཁོང་ཁྲོ་བའི་སེམས་མེད་པ་དང་། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བླངས་ནས་ཐམས་ཅད་སྲུང་བ་དང་། གཞན་གྱི་ཉེས་པ་མི་གླེང་ཞིང་བརྙས་པར་མི་བྱེད་པ་དང་། བདག་གི་འཁྲུལ་པ་ལ་རྟོག་པར་བྱེད་ཀྱི་གཞན་གྱི་འཁྲུལ་པ་ལ་མི་རྟོག་པ་སྟེ།
en: They are being free of anger toward any being, taking up and carefully observing the path of the ten virtues, not criticizing others or mentioning their faults, and focusing on their own errors rather than those of others.

source: ཀླུའི་བདག་པོ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ངན་འགྲོ་དང་། ངན་སོང་ཐམས་ཅད་ཡང་དག་པར་ཆད་པར་འགྱུར་རོ།
en: Nāga Lord, if bodhisattvas possess these four qualities, they will genuinely eliminate rebirth in the lower realms and painful transmigrations.

source: །ཀླུའི་བདག་པོ་ཆོས་བཞི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་མི་ཁོམ་པ་ཐམས་ཅད་སྤོང་བར་འགྱུར་ཏེ།
en: “Nāga Lord, if bodhisattvas possess four qualities, they will abandon all unfavorable conditions.

source: བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these four?

source: དཀོན་མཆོག་གསུམ་པོ་འདི་ལྟ་སྟེ། སངས་རྒྱས་དཀོན་མཆོག་དང་། ཆོས་དཀོན་མཆོག་དང་། དགེ་འདུན་དཀོན་མཆོག་གི་བསྔགས་པ་རྒྱུན་དུ་བརྗོད་པ་དང་། ཆོས་འདོད་པ་རྣམས་གཡེངས་པར་མི་བྱེད་པ་དང་། གཞན་དག་གི་འགྱོད་པ་མི་སྐྱེད་པ་དང་། སེམས་ཅན་འགྱོད་ཅིང་འདུག་པ་རྣམས་ཀྱི་འགྱོད་པ་སེལ་བ་སྟེ།
en: They are to constantly sing the praises of the Three Jewels—the Buddha Jewel, the Dharma Jewel, and the Saṅgha Jewel, to never distract anyone dedicated to the Dharma, to never cause others to feel regret, and to dispel the regret of beings mired in regret.

source: ཀླུའི་བདག་པོ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མི་ཁོམ་པ་ཐམས་ཅད་སྤོང་བར་འགྱུར་རོ།
en: Nāga Lord, if bodhisattvas possess these four qualities, they will abandon all unfree states.

source: །ཀླུའི་བདག་པོ་ཆོས་བཞི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལྷ་དང་མིའི་སྐྱེ་བར་འགྲོ་བར་འགྱུར་ཏེ།
en: “Nāga Lord, if bodhisattvas possess four qualities, they will take human and divine births.

source: བྱང་ཆུབ་ཀྱི་སེམས་མི་གཏོང་ཞིང་གཞན་དག་ལ་ཡང་སྒྲོགས་པ་དང་། ཚུལ་ཁྲིམས་ཡང་དག་པར་བླངས་པ་མི་གཏོང་ཞིང་ཉམས་པར་མི་བྱེད་པ་དང་། སྨོན་ལམ་ལ་བསམ་པ་རྣམ་པར་དག་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་དེ་དག་ལ་སྙིང་རྗེ་ཆེན་པོ་སྐྱེད་པ་སྟེ།
en: They are never giving up the mind set on awakening and proclaiming it to others, never giving up genuine training in discipline or letting it decline, keeping the intention concerning aspiration pure, and developing great compassion for beings in order to ripen them.

source: ཀླུའི་བདག་པོ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལྷ་དང་མིའི་སྐྱེ་བར་འགྲོ་བར་འགྱུར་རོ།
en: Nāga Lord, if bodhisattvas possess these four qualities, they will take human and divine births.

source: །ཀླུའི་བདག་པོ་ཆོས་བརྒྱད་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སངས་རྒྱས་མཐོང་བ་དང་འབྲལ་བར་མི་འགྱུར་ཏེ།
en: “Nāga Lord, if bodhisattvas possess eight qualities, they will never lose their vision of the buddhas.

source: བརྒྱད་གང་ཞེ་ན་འདི་ལྟ་སྟེ།
en: What are these eight?

source: སངས་རྒྱས་རྗེས་སུ་དྲན་པ་ཡིད་ལ་བྱེད་པ་དང་། དེ་བཞིན་གཤེགས་པ་ལ་བསྙེན་བཀུར་དང་། མཆོད་པ་བྱེད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་བསྔགས་པ་རྒྱུན་དུ་བརྗོད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་བྱེད་དུ་འཇུག་པ་དང་། དེ་བཞིན་གཤེགས་པ་ལྟ་བ་ལ་སེམས་ཅན་རྣམས་ཡང་དག་པར་འཛུད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གང་ན་དེ་བཞིན་གཤེགས་པ་བཞུགས་པ་ཐོས་པ་དེར་སྐྱེ་བར་སྨོན་ལམ་འདེབས་པ་དང་། རྒྱུད་ཞུམ་པ་མེད་ཅིང་རྒྱ་ཆེན་པོ་ལ་མོས་པ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་འདོད་པ་སྟེ། ཀླུའི་བདག་པོ་ཆོས་བརྒྱད་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སངས་རྒྱས་མཐོང་བ་དང་འབྲལ་བར་མི་འགྱུར་རོ།
en: They are focusing on the recollection of the buddha, serving and venerating the thus-gone ones, constantly singing the praises of the thus-gone ones, commissioning images of the thus-gone ones, encouraging beings to see the thus-gone ones, making the aspiration to be born in any buddha realm where one has heard that a thus-gone one lives, being courageous and inspired toward vastness, and yearning for the wisdom of buddhahood. Nāga Lord, if bodhisattvas possess these eight qualities, they will never lose sight of the buddhas.

source: །ཀླུའི་བདག་པོ་ཆོས་བཞི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དགེ་བའི་བཤེས་གཉེན་རྙེད་པར་འགྱུར་ཏེ།
en: “Nāga Lord, if bodhisattvas possess four qualities, they will meet spiritual friends.

source: དགེ་བའི་བཤེས་གཉེན་ལ་སྒྱུ་མེད་པ་དང་གཡོ་མེད་པར་བསྙེན་བཀུར་བྱེད་པ་དང་། ཆོས་ལ་གཅེས་པ་དང་གུས་པ་དང་རི་མོ་བྱེད་པ་དང་། བཀའ་བློ་བདེ་ཞིང་གསོ་སླ་ལ་དེས་པ་དང་། ང་རྒྱལ་མེད་ཅིང་སྲི་ཞུ་བྱེད་པ་སྟེ།
en: They are serving one’s spiritual friend without deceit or pretense; cherishing, respecting, and serving the Dharma; being open to advice, easily satisfied, and gentle; and being humble and deferential.

source: ཀླུའི་བདག་པོ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དགེ་བའི་བཤེས་གཉེན་རྙེད་པར་འགྱུར་རོ།
en: Nāga Lord, if bodhisattvas possess these four qualities, they will meet spiritual friends.

source: །ཀླུའི་བདག་པོ་ཆོས་གསུམ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་འཚམ་པའི་ཡུལ་དུ་གནས་པ་ཐོབ་པར་འགྱུར་ཏེ།
en: “Nāga Lord, if bodhisattvas possess three qualities, they will find agreeable places to stay.

source: གསུམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these three?

source: མི་བརླང་ཞིང་གྱ་གྱུ་མེད་པའི་སེམས་དང་ལྡན་པ་དང་། ཕྲག་དོག་དང་སེར་སྣ་བསལ་བ་དང་། གཞན་དག་གི་རྙེད་པ་དང་བཀུར་སྟི་དང་བདེ་བར་སྦྱར་བ་ལ་དགའ་བ་སྟེ།
en: They are having a tender and honest mind, eliminating jealousy and stinginess, and being pleased to support others’ gain, service, and happiness.

source: ཀླུའི་བདག་པོ་ཆོས་གསུམ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་འཚམ་པའི་ཡུལ་དུ་གནས་པ་ཐོབ་པར་འགྱུར་རོ།
en: Nāga Lord, if bodhisattvas possess these three qualities, they will find agreeable places to stay.

source: །ཀླུའི་བདག་པོ་ཆོས་ལྔ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དད་པ་དང་ལྡན་པར་འགྱུར་ཏེ།
en: “Nāga Lord, if bodhisattvas possess five qualities, they will have faith.

source: ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these five?

source: མོས་པའི་སྟོབས་དང་། བསོད་ནམས་ཀྱི་ཚོགས་ཀྱི་སྟོབས་དང་། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་འཇུག་པའི་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་སེམས་མི་གཏོང་བའི་སྟོབས་དང་། ཆོས་ཉིད་ལ་རྟོན་པའི་སྟོབས་ཏེ།
en: They are the strength of interest, the strength of the accumulation of merit, the strength of understanding the ripening of karma, the strength of not giving up the mind set on awakening, and the strength of being grounded in reality.

source: ཀླུའི་བདག་པོ་ཆོས་ལྔ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དད་པ་དང་ལྡན་པར་འགྱུར་རོ།
en: Nāga Lord, if bodhisattvas possess these five qualities, they will have faith.

source: །ཀླུའི་བདག་པོ་ཆོས་གཉིས་དང་ལྡན་ན་དགའ་བའི་ཤས་ཆེ་བར་འགྱུར་ཏེ།
en: “Nāga Lord, if bodhisattvas possess two qualities, they will become exceedingly joyful.

source: གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are the two?

source: རྒྱུའི་སྟོབས་དང་། ཡང་དག་པར་སྦྱོར་བའི་སྟོབས་ཏེ།
en: They are the strength of causes and the strength of engagement.

source: ཀླུའི་བདག་པོ་ཆོས་དེ་གཉིས་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དགའ་བའི་ཤས་ཆེ་བར་འགྱུར་རོ།
en: Nāga Lord, if bodhisattvas possess these two qualities, they will become exceedingly joyful.

source: །ཀླུའི་བདག་པོ་ཆོས་གསུམ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་རྟོན་པར་འགྱུར་ཏེ།
en: “Nāga Lord, if bodhisattvas possess three qualities, they will be supported by the ripening of karma.

source: གསུམ་གང་ཞེ་ན།
en: What are these three?

source: འདི་ལྟ་སྟེ་བདག་མེད་པ་ལ་མོས་པ་དང་། བཟོད་པའི་སྟོབས་དང་། ཡང་དག་པའི་ལས་ལ་ལེགས་པར་བརྩོན་པ་སྟེ།
en: They are aspiring to selflessness, the strength of patience, and diligently pursuing proper action.

source: ཀླུའི་བདག་པོ་ཆོས་གསུམ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་རྟོན་པར་འགྱུར་རོ།
en: Nāga Lord, if bodhisattvas possess these three qualities, they will be supported by the ripening of karma.

source: །ཀླུའི་བདག་པོ་ཆོས་གཉིས་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་མི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྤངས་ནས་དགེ་བའི་ཆོས་ཐམས་ཅད་ཀྱིས་འབོགས་པར་འགྱུར་ཏེ།
en: “Nāga Lord, if bodhisattvas possess two qualities, they will be ripe with all virtuous qualities, having abandoned all nonvirtuous qualities.

source: ཕུང་པོ་གསུམ་གྱི་ཡོངས་སུ་བསྔོ་བ་དང་ལྡན་པ་དང་། བག་ཡོད་པར་གནས་པ་སྟེ། དེ་གཉིས་སོ།
en: They are to offer a dedication that comprises the three parts, and to maintain carefulness.

source: །གཞན་ཡང་གཉིས་ཏེ། འདི་ལྟ་སྟེ། དགེ་བའི་རང་བཞིན་དུ་གྱུར་པ་དང་། རྣམ་པར་སྨིན་པ་ལ་མི་རེ་བ་སྟེ།
en: Alternatively, the two are having a virtuous nature and not hoping for a particular ripening.

source: ཀླུའི་བདག་པོ་ཆོས་དེ་གཉིས་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་མི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྤངས་ནས་དགེ་བའི་ཆོས་ཐམས་ཅད་ཀྱིས་འབོགས་པར་འགྱུར་རོ།
en: Nāga Lord, if bodhisattvas possess these two qualities, they will be ripe with all virtuous qualities, having abandoned all nonvirtuous qualities.

source: །ཀླུའི་བདག་པོ་ཆོས་ལྔ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆོས་དོན་དུ་གཉེར་བ་ཡིན་ཏེ།
en: “Nāga Lord, if bodhisattvas possess five qualities, they will take interest in the Dharma.

source: གཟུགས་དོན་དུ་གཉེར་བ་མ་ཡིན་པ་དང་། སྒྲ་དོན་དུ་གཉེར་བ་མ་ཡིན་པ་དང་། དྲི་དོན་དུ་གཉེར་བ་མ་ཡིན་པ་དང་། རོ་དོན་དུ་གཉེར་བ་མ་ཡིན་པ་དང་། རེག་བྱ་དོན་དུ་གཉེར་བ་མ་ཡིན་པ་སྟེ། ལྔ་པོ་ནི་དེ་དག་ཡིན་ནོ།
en: They are being disinterested in form, being disinterested in sound, being disinterested in scent, being disinterested in taste, and being disinterested in touch.

source: །ཀླུའི་བདག་པོ་གཞན་ཡང་ཆོས་ལྔ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆོས་དོན་དུ་གཉེར་བ་ཡིན་ཏེ།
en: Nāga Lord, if bodhisattvas possess these five qualities, they will take interest in the Dharma. Nāga Lord, if bodhisattvas possess an alternate set of five qualities, they will take interest in the Dharma.

source: ཆོས་དོན་དུ་གཉེར་བ་ཡིན་གྱི་ལུས་དོན་དུ་གཉེར་བ་མ་ཡིན་པ་དང་། ཡོན་ཏན་དོན་དུ་གཉེར་བ་ཡིན་གྱི་སྲོག་དོན་དུ་གཉེར་བ་མ་ཡིན་པ་དང་། ཤེས་རབ་དོན་དུ་གཉེར་བ་ཡིན་གྱི་རེག་པ་དོན་དུ་གཉེར་བ་མ་ཡིན་པ་དང་། དགེ་བ་དོན་དུ་གཉེར་བ་ཡིན་གྱི་ཚོར་བ་དོན་དུ་གཉེར་བ་མ་ཡིན་པ་དང་། སེམས་ཅན་ཡོངས་སུ་བསྐྱབ་པ་དོན་དུ་གཉེར་བ་ཡིན་གྱི། བདག་གི་བདེ་བ་དོན་དུ་གཉེར་བ་མ་ཡིན་པ་སྟེ།
en: They are being interested in the Dharma rather than in one’s body, being interested in qualities rather than in one’s life, being interested in insight rather than in touch, being interested in virtue rather than in feeling, and being interested in protecting beings rather than in one’s own happiness.

source: ཀླུའི་བདག་པོ་ཆོས་ལྔ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆོས་དོན་དུ་གཉེར་བ་ཡིན་ནོ།
en: Nāga Lord, if bodhisattvas possess these qualities, they will take interest in the Dharma.

source: །ཀླུའི་བདག་པོ་ཆོས་དྲུག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆོས་འདོད་པ་ཡིན་ཏེ།
en: “Nāga Lord, if bodhisattvas possess six qualities, they will desire the Dharma.

source: དྲུག་པོ་དག་གང་ཞེ་ན།
en: What are these six?

source: འདི་ལྟ་སྟེ་རབ་ཏུ་བྱུང་བའི་ཡོན་ཏན་འདོད་ཀྱི།
en: They are desiring the qualities of renunciation rather than desiring to merely adopt the token robes;

source: གོས་ཚོན་ཅན་གྱི་རྟགས་འཛིན་པ་ཙམ་འདོད་པ་མ་ཡིན་པ་དང་། ཆོས་ཉན་པ་འདོད་ཀྱི་འཇིག་རྟེན་རྒྱང་པ་ན་པའི་གསང་ཚིག་ཉན་འདོད་པ་མ་ཡིན་པ་དང་། ཆོས་བསྟན་པ་འདོད་ཀྱི་འཇིག་རྟེན་གྱི་ཟང་ཟིང་འདོད་པ་མ་ཡིན་པ་དང་། ཆོས་ལ་སོ་སོར་རྟོག་པར་འདོད་ཀྱི་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པར་འདོད་པ་མ་ཡིན་པ་དང་། ཆོས་བསྒྲུབ་པ་འདོད་ཀྱི་ཡི་གེ་དང་ངེས་པའི་ཚིག་དང་བརྡ་ཡོངས་སུ་ཚོལ་བ་འདོད་པ་མ་ཡིན་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཉན་འདོད་ཀྱི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཆོས་འདོད་པ་མ་ཡིན་པ་སྟེ།
en: desiring to hear the Dharma rather than desiring to listen to the persuasions of the Lokāyatas; desiring Dharma teachings rather than desiring worldly goods; discerning the Dharma rather than focusing on inappropriate matters; desiring to accomplish the Dharma rather than desiring to study words, etymologies, and definitions; and desiring to hear about the qualities of buddhahood rather than desiring to hear about the qualities of the hearers and solitary buddhas.

source: ཀླུའི་བདག་པོ་ཆོས་དྲུག་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆོས་འདོད་པ་ཡིན་ནོ།
en: Nāga Lord, if bodhisattvas possess these six qualities, they will desire the Dharma.

source: །ཀླུའི་བདག་པོ་ཆོས་བརྒྱད་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆོས་ཀྱི་ཀུན་དགའ་ལ་དགའ་བས་དགའ་བ་ཡིན་ཏེ།
en: “Nāga Lord, if bodhisattvas possess eight qualities, they will find great delight in the Dharma.

source: བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these eight? They are delighting in discussion of the mind set on awakening rather than discussion of the Lesser Vehicle;

source: བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་གཏམ་ལ་དགའི་ཐེག་པ་དམན་པའི་གཏམ་ལ་མ་ཡིན་པ་དང་། བསྡུ་བའི་དངོས་པོའི་གཏམ་ལ་དགའི་ཕྱིན་ཅི་ལོག་གི་གཏམ་ལ་མ་ཡིན་པ་དང་། ཆོས་ཀྱི་ལུགས་ཀྱི་གཏམ་ལ་དགའི་འཇིག་རྟེན་རྒྱང་པ་ན་པོའི་གཏམ་ལ་མ་ཡིན་པ་དང་། སངས་རྒྱས་ཀྱི་ཆེ་བ་ཉིད་ཀྱི་གཏམ་ལ་དགའི་འཁོར་བ་བཅད་པའི་གཏམ་ལ་མ་ཡིན་པ་དང་། ཟབ་ཅིང་གཏིང་དཔག་དཀའ་བའི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་གཏམ་ལ་དགའི་བདག་ཏུ་ལྟ་བ་འཛིན་པའི་གཏམ་ལ་མ་ཡིན་པ་དང་། ཆོས་བདག་མེད་པའི་རང་བཞིན་དང་རྐྱེན་རྣམ་པར་དག་པའི་གཏམ་ལ་དགའི་ཆད་པ་དང་། རྟག་པ་དང་། བདག་དང་། སེམས་ཅན་དང་། སྲོག་དང་སྐྱེས་བུ་དང་། གང་ཟག་ཏུ་འཛིན་པའི་གཏམ་ལ་མ་ཡིན་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་གཏམ་ཡང་དག་པ་ཇི་ལྟ་བ་ལ་དགའི།
en: delighting in discussion of the means of attracting disciples rather than in discussion of what is mistaken; delighting in discussion of the Dharma tradition rather than in materialistic discussions; delighting in discussion of the Buddha’s greatness rather than in discussion of the end of saṃsāra; delighting in discussion of the profound and difficult subject of dependent origination rather than in discussion of the belief in the view of self; delighting in discussions of the selfless nature of phenomena and in pure conditions rather than in discussion of the beliefs in nihilism, eternalism, self, being, life force, person, or individuality;

source: དམིགས་པར་ལྟ་བའི་གཏམ་ལ་མ་ཡིན་པ་དང་། རབ་ཏུ་བྱུང་བ་ལ་དམིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གི་རྒྱན་བཀོད་པའི་གཏམ་ལ་དགའི།
en: delighting in genuine and accurate discussion of emptiness, the absence of marks, and the absence of wishes, rather than in discussion of views involving reference points;

source: ཞི་བ་ལ་བཏང་སྙོམས་སུ་བྱེད་པའི་གཏམ་ལ་མ་ཡིན་པ་སྟེ།
en: and delighting in discussion concerned with renunciation and the display of the ornaments in the buddha realms rather than in discussion that causes indifference to peace.

source: ཀླུའི་བདག་པོ་ཆོས་བརྒྱད་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆོས་ཀྱི་ཀུན་དགའ་ལ་དགའ་བས་དགའ་བ་ཡིན་ནོ།
en: Nāga Lord, if bodhisattvas possess these eight qualities, they will find great delight in the Dharma.

source: །ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་དོན་གྱི་དབང་རྣམ་པ་ལྔ་མཐོང་བའི་ཕྱིར་ཐོས་པ་ཡོངས་སུ་ཚོལ་བ་ན་ཆོག་མི་ཤེས་ཏེ།
en: “Nāga Lord, bodhisattvas must be insatiable in the pursuit of learning if they are to see five essential points.

source: ལྔ་གང་ཞེ་ན།
en: What are these five?

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཐོས་པ་ལས་ཤེས་རབ་འབྱུང་བར་ཡང་དག་པར་མཐོང་བའི་ཕྱིར་ཐོས་པ་ཡོངས་སུ་ཚོལ་བ་ན་ཆོག་མི་ཤེས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཐོས་པས་འགྱོད་པ་དང་ཐེ་ཚོམ་མེད་པར་འགྱུར་བ་ཡང་དག་པར་མཐོང་བའི་ཕྱིར་ཐོས་པ་ཡོངས་སུ་ཚོལ་བ་ན་ཆོག་མི་ཤེས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཐོས་པས་ཀུན་ནས་ཉོན་མོངས་པ་དང་རྣམ་པར་བྱང་བ་རྟོགས་པར་འགྱུར་བར་ཡང་དག་པར་མཐོང་བའི་ཕྱིར་ཐོས་པ་ཡོངས་སུ་ཚོལ་བ་ན་ཆོག་མི་ཤེས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཐོས་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་སྤང་བའི་ཕྱིར།
en: Bodhisattvas must be insatiable in the pursuit of learning in order to see correctly with the genesis of insight through learning. Bodhisattvas must be insatiable in the pursuit of learning in order to see correctly with the elimination of regret and doubt through learning. Bodhisattvas must be insatiable in the pursuit of learning in order to see correctly with the growth of the understanding of pollution and purification through learning. Bodhisattvas must be insatiable in the pursuit of learning in order to see correctly with the elimination of afflictions in all beings through learning and thereby the elimination of all afflictions.

source: ཉོན་མོངས་པ་སྤོང་བར་འགྱུར་བར་ཡང་དག་པར་མཐོང་བའི་ཕྱིར་ཐོས་པ་ཡོངས་སུ་ཚོལ་བ་ན་ཆོག་མི་ཤེས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཐོས་པས་མི་འཇིགས་པར་འགྱུར་ལ་མི་འཇིགས་པ་ལས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐེ་ཚོམ་ཆད་པར་འགྱུར་བར་ཡང་དག་པར་མཐོང་བའི་ཕྱིར་ཐོས་པ་ཡོངས་སུ་ཚོལ་བ་ན་ཆོག་མི་ཤེས་པ་སྟེ་ལྔ་པོ་དེ་དག་གོ།
en: Bodhisattvas must be insatiable in the pursuit of learning in order to see correctly with the growth of fearlessness through learning and thereby the termination of all beings’ anxieties.

source: །གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་དོན་གྱི་དབང་རྣམ་པ་གཉིས་མཐོང་བའི་ཕྱིར་ཐོས་པ་ཡོངས་སུ་ཚོལ་བ་ན་ཆོག་མི་ཤེས་ཏེ་གཉིས་གང་ཞེ་ན།
en: Moreover, bodhisattvas must be insatiable in the pursuit of learning in order to see two essential points. What are these two?

source: འཕགས་པའི་ཡང་དག་པའི་ལྟ་བ་སྐྱེ་བ་དང་། ཆགས་པ་མེད་པའི་གཟུངས་འཐོབ་པ་སྟེ་དེ་གཉིས་སོ།
en: They are the dawning of the correct view of noble beings and the attainment of unfettered recollection.

source: །ཀླུའི་བདག་པོ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཐོས་པ་སྒྲུབ་པས་མངོན་པར་འཕགས་པར་འགྱུར་ཏེ་བཅུ་གང་ཞེ་ན།
en: “Nāga Lord, if bodhisattvas possess ten qualities, they will become exalted in terms of their accomplishment of learning. What are these ten?

source: རྙེད་པ་དང་བཀུར་སྟི་རྣམས་ལ་འདོད་པ་ཉུང་ཞིང་ཆོག་ཤེས་པ་དང་། ཡོངས་སུ་ཚོལ་བ་རྣམས་ལ་ལུས་དང་སྲོག་ལ་མི་ལྟ་བ་དང་། སྤྱོད་ལམ་རྣམས་ལ་དྲན་པ་དང་། ཤེས་བཞིན་པ་དང་། ཇི་སྐད་ཐོས་པ་ལ་ཤས་ཆེར་ཡོངས་སུ་རྟོག་པ་དང་། འདུ་འཛི་མེད་པས་བྱ་བ་ཉུང་བ་དང་། སྦྱོར་བ་ལ་བརྩོན་པའི་བརྩོན་འགྲུས་ཀྱིས་ནམ་གྱི་ཆ་སྟོད་དང་། ནམ་གྱི་ཆ་སྨད་ལ་མི་ཉལ་བ་དང་། བླ་མ་ལ་གུས་པ་དང་། རི་མོ་བྱེད་པ་དང་། ངོ་ཚ་ཤེས་པ་དང་། ཁྲེལ་ཡོད་པ་ཕུན་སུམ་ཚོགས་པས་དགེ་བའི་བཤེས་གཉེན་ལ་བསྟེན་པ་དང་། སྙིང་རྗེ་ཆེན་པོས་སེམས་ཅན་ལ་ལྟ་བ་དང་། ཡོན་ཏན་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་འཕགས་པའི་སྐྱེ་བོ་ལ་རིམ་གྲོ་བྱེད་པ་དང་། ཤེས་པས་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་ཡོངས་སུ་བསྐྱབ་པ་སྟེ།
en: They are having few desires for and being content with gain and honor, having no concern for their body and life force in their pursuits, being mindful and aware in their actions, thinking very carefully about exactly what they have learned, minimizing activities by having no worldly diversions, not sleeping at the beginning or end of the night through being diligent in their practice, respecting and serving their master, relying on the spiritual teacher with humility and modesty, caring for beings with great compassion, honoring noble beings in order to perfect positive qualities, and protecting with knowledge the world and its gods.

source: ཀླུའི་བདག་པོ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཐོས་པ་སྒྲུབ་པས་མངོན་པར་འཕགས་པར་འགྱུར་རོ།
en: Nāga Lord, if bodhisattvas possess these ten qualities, they will become exalted in terms of their accomplishment of learning.

source: །ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཕན་ཡོན་རྣམ་པ་ལྔ་པོ་འདི་དག་ཡང་དག་པར་མཐོང་ནས། རབ་ཏུ་འབྱུང་བ་ལ་མོས་པར་འགྱུར་ཏེ།
en: “Nāga Lord, if bodhisattvas truly see these five benefits, they will be inspired to go forth.

source: བདག་གིས་ལས་བྱས་པ་ཆུད་ཟ་བར་མི་འགྱུར་བ་དང་། བདག་གིས་བྱས་པའི་བག་ཆགས་ཀྱིས་བསྒོ་བར་འགྱུར་བ་དང་། ཡོངས་སུ་འཛིན་པ་ཐམས་ཅད་ལ་བདག་གི་སེམས་གཏོང་བར་འགྱུར་བ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་བདག་སྨད་པར་མི་འགྱུར་བ་དང་། བདག་གྲོལ་ཟིན་ནས་ཀྱང་ཉོན་མོངས་པའི་བཅིང་བ་རྣམས་ཀྱིས་བཅིངས་པའི་སེམས་ཅན་རྣམས་འཆིང་བ་དེ་ལས་རབ་ཏུ་ཐར་བར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་པར་འགྱུར་རོ་སྙམ་པ་སྟེ་ལྔ་པོ་དེ་དག་གོ།
en: They are thinking that the actions one has committed will not go to waste, that one is influenced by the habitual patterns one has formed, that everything that is grasped for should be abandoned, that one will not be disparaged by the blessed buddhas, and that—even after having become liberated—one will still teach the Dharma in order to release from their shackles all beings who are fettered by the shackles of the afflictions. These are the five. “There is another set of five benefits.

source: །གཞན་ཡང་རྣམ་པ་ལྔ་སྟེ་ལྔ་གང་ཞེ་ན།
en: What are these five?

source: རབ་ཏུ་འབྱུང་བ་ནི་ཚུལ་ཁྲིམས་འཆལ་པའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཚུལ་ཁྲིམས་དང་འཐུན་པ་ཡིན་ནོ། །རབ་ཏུ་འབྱུང་བ་ནི་ཐོས་པ་ཉུང་བའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཐོས་པ་དང་འཐུན་པ་ཡིན་ནོ། །རབ་ཏུ་འབྱུང་བ་ནི་སེམས་རྣམ་པར་གཡེངས་པའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཏིང་ངེ་འཛིན་དང་འཐུན་པ་ཡིན་ནོ། །རབ་ཏུ་འབྱུང་བ་ནི་ཤེས་རབ་འཆལ་པའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཤེས་རབ་དང་འཐུན་པ་ཡིན་ནོ། །རབ་ཏུ་འབྱུང་བ་ནི་མྱ་ངན་ལས་འདས་པའི་བདེ་བའི་ལམ་ལ་སེམས་ཅན་དགོད་པར་བྱ་བའི་ཕྱིར་རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་དང་འཐུན་པ་ཡིན་ཏེ།
en: They are knowing that going forth accords with discipline because it ripens beings with impaired discipline, that it accords with learning because it ripens beings without learning, that it accords with absorption because it ripens distracted beings, that it accords with insight because it ripens beings with mistaken insight, and that it accords with the wisdom of liberation because it establishes beings on the path to the bliss of nirvāṇa.

source: ལྔ་པོ་དེ་དག་གོ།
en: These are the five.

source: །གཞན་ཡང་རྣམ་པ་ལྔ་སྟེ།
en: “There is another set of five benefits.

source: རབ་ཏུ་འབྱུང་བ་ནི་ཕུང་པོ་ལྔ་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ཕྱིར་ང་རྒྱལ་བཅོམ་པའོ།
en: They are knowing that going forth defeats pride because it enables one to understand the five aggregates;

source: །རབ་ཏུ་འབྱུང་བ་ནི་ཀུན་འབྱུང་བ་སྤང་བའི་ཕྱིར་སྲེད་པའི་བག་ལ་ཉལ་སྤོང་བའོ།
en: that it eliminates the habitual tendency of craving because one can abandon origination;

source: །རབ་ཏུ་འབྱུང་བ་ནི་འགོག་པ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་ཞི་བ་དང་། རབ་ཏུ་ཞི་བ་དང་། ཉེ་བར་ཞི་བར་བྱེད་པའོ།
en: that it pacifies, fully pacifies, and deeply pacifies because one can actualize cessation;

source: །རབ་ཏུ་འབྱུང་བ་ནི་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་བསྒོམ་པའི་ཕྱིར་ལམ་ལ་འཇུག་གོ།
en: that it is an entrance to the path because one can cultivate the eightfold path of the noble ones;

source: །རབ་ཏུ་འབྱུང་བ་ནི་འཕགས་པའི་བདེན་པ་རྣམས་ལ་སེམས་ཅན་དགོད་པའི་ཕྱིར་བདེན་པ་ལ་འཇུག་པ་སྟེ།
en: and that it penetrates the truth because one can establish beings in the truths.

source: །ཀླུའི་བདག་པོ་ཆོས་བཞི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནགས་དང་ནགས་འདབ་ན་རྒྱུ་ཞིང་བས་མཐའི་གནས་མལ་དག་ན་གནས་པ་ཡིན་ཏེ།
en: “Nāga Lord, if bodhisattvas possess four qualities, they will travel through jungles and forests and stay in dwellings in the hinterlands.

source: བཞི་གང་ཞེ་ན།
en: What are these four?

source: ལུས་དང་སྲོག་ལ་མི་ལྟ་བ་དང་། དགེ་བའི་ཆོས་ཐམས་ཅད་ལ་ལྟ་བ་དང་། མངོན་པར་ཤེས་པའི་ཤེས་པ་སྐྱེད་པར་འདོད་པ་དང་། སྤྱོད་ལམ་རབ་ཏུ་ཞི་བས་ལྷ་དང་མི་རྣམས་མགུ་བར་བྱེད་པ་སྟེ།
en: They are not caring for their body and life force, caring for all virtuous qualities, wishing to develop the higher knowledges, and pleasing gods and humans with their gentle comportment.

source: ཀླུའི་བདག་པོ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནགས་དང་། ནགས་འདབ་ན་རྒྱུ་ཞིང་བས་མཐའི་གནས་མལ་དག་ན་གནས་པ་ཡིན་ནོ།
en: Nāga Lord, if bodhisattvas possess these four qualities, they will travel through jungles and forests and stay in dwellings in the hinterlands.

source: །ཀླུའི་བདག་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ནི་དོན་གྱི་དབང་རྣམ་པ་བཞི་མཐོང་ནས། ནགས་དང་ནགས་འདབ་ན་རྒྱུ་ཞིང་བས་མཐའི་གནས་མལ་དག་ན་གནས་པ་ཡིན་ཏེ།
en: “Alternatively, Nāga Lord, if bodhisattvas see a different set of four essential points, they will travel through jungles and forests and stay in dwellings in the hinterlands.
